app/views/mtx_order/show_list.html.erb

SELECT COUNT(*) FROM `mtx_orders`
---
      <th><%= sortable "mtx_user.username", I18n.t('activerecord.attributes.user.username') %></th>
      <th><%= sortable "total", I18n.t('activerecord.attributes.order.total') %></th>