app/controllers/home_controller.rb

SELECT  `mtx_weekly_menu`.* FROM `mtx_weekly_menu` WHERE (day_key = 'tue') LIMIT 1
SELECT `mtx_weekly_menu_detail`.* FROM `mtx_weekly_menu_detail` WHERE (weekly_menu_id = 2)
---
  def index
    @dayOfWeekList = {1 => "mon",
                      2 => "tue",
                      3 => "wed",
                      4 => "thu",
                      5 => "fri",
                      6 => "sat",
                      0 => "sun"
    }
    @today = @dayOfWeekList[Date.today.wday]
    @weeklyMenuToday = MtxWeeklyMenu.find_by(["day_key = ?", @today])
    @weeklyMenuDetailToday = nil
    if (@weeklyMenuToday != nil)
      @weeklyMenuDetailToday = MtxWeeklyMenuDetail.includes(:mtx_product).where("weekly_menu_id = ?", @weeklyMenuToday.id)