app/controllers/mtx_order_controller.rb

SELECT  `mtx_orders`.* FROM `mtx_orders`  ORDER BY id asc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `mtx_orders`
SELECT `mtx_user`.* FROM `mtx_user` WHERE `mtx_user`.`id` IN (1, 2)
---
  def show_list
    @orders = MtxOrder.includes(:mtx_user).order(sort_column + " " + sort_direction).page(params[:page]).per(3)