app/controllers/place_orders_controller.rb

SELECT  `mtx_product`.* FROM `mtx_product` WHERE `mtx_product`.`id` = 1 LIMIT 1
---
  def index
    @product_items_session = session[:order_items]
    ids = ''

    @product_items_session.each do |items_session|
      ids += items_session + ','
    end

    @product = MtxProduct.where('id in ('+ids[0,ids.length-1]+')')