app/controllers/place_orders_controller.rb

  def index
    @daily_menu = MtxWeeklyMenu.find(1)
    @daily_menu_detail = @daily_menu.mtx_weekly_menu_details.all
---
SELECT  `mtx_weekly_menu`.* FROM `mtx_weekly_menu` WHERE `mtx_weekly_menu`.`id` = 1 LIMIT 1
SELECT `mtx_weekly_menu_detail`.* FROM `mtx_weekly_menu_detail` WHERE `mtx_weekly_menu_detail`.`weekly_menu_id` = 1

  def create_order
    # Create order
    order = MtxOrder.new
    order.customer_id = current_user.id
    order.phone = 'phone'
    order.email = 'email address'
    order.discount = 0
    order.status = 1
    order.shipping_address = 'shipping_address'
    order.note = 'note'
    order.total = params[:total_order].to_i

    # Create order detail
    params[:product].each do |key,value|
      @product_id = key.split('_')[0]
      @product_price = key.split('_')[1]
      puts "Product id #{@product_id} with price #{@product_price} have order #{value} quantity"
      orderDetail = MtxOrderDetail.new
      orderDetail.product_id = @product_id
      orderDetail.quantity = value
      orderDetail.price = @product_price
      order.mtx_order_details << orderDetail
---
INSERT INTO `mtx_order_detail` (`product_id`, `quantity`, `price`, `order_id`) VALUES (1, 10, 100.0, 8)
INSERT INTO `mtx_orders` (`customer_id`, `phone`, `email`, `discount`, `status`, `shipping_address`, `note`, `total`, `created_at`, `updated_at`) VALUES (1, 'phone', 'email address', 0, 1, 'shipping_address', 'note', 0.0, '2015-10-14 12:57:44', '2015-10-14 12:57:44')