app/controllers/weekly_menu_controller.rb

SELECT  `mtx_weekly_menu`.* FROM `mtx_weekly_menu` WHERE (day_key = 'mon') LIMIT 1
SELECT `mtx_product`.* FROM `mtx_product`
---
  def manage
    #get product of weekly menu
    @dayOfWeek = params[:dayOfWeek]
    @productOfWeekDay = MtxWeeklyMenu.find_by(["day_key = ?", @dayOfWeek])
    # config.logger = Logger.new(STDOUT)
    # logger.debug "1111111111111111"
    # logger.debug {@productOfWeekDay.mtx_weekly_menu_details}
    # exit

    #get all product
    @productList = MtxProduct.all

SELECT  `mtx_weekly_menu`.* FROM `mtx_weekly_menu` WHERE (day_key = 'wed') LIMIT 1
INSERT INTO `mtx_weekly_menu_detail` (`product_id`, `weekly_menu_id`) VALUES (1, 3)
INSERT INTO `mtx_weekly_menu` (`day_key`, `created_at`, `updated_at`) VALUES ('wed', '2015-10-14 02:55:57', '2015-10-14 02:55:57')
---
  def update
    @ds4WeekDaySelect = {:mon => "Monday",
                         :tue => "Tuesday",
                         :wed => "Wednesday",
                         :thu => "Thursday",
                         :fri => "Friday",
                         :sat => "Satusday",
                         :sun => "Sunday"
    }

    @dayOfWeek = params[:weekday]
    @productIds = params[:ids]

    @weekDay = MtxWeeklyMenu.find_by(["day_key = ?", @dayOfWeek])
    if !@weekDay.nil?
        @weekDay.mtx_weekly_menu_details.each {
            |p| p.destroy
        }
    else
      @weekDay = MtxWeeklyMenu.create(:day_key => @dayOfWeek, :day_title => @ds4WeekDaySelect[:@dayOfWeek])