app/views/place_orders/index.html.erb

SELECT  `mtx_product_language`.* FROM `mtx_product_language` WHERE `mtx_product_language`.`product_id` = 1  ORDER BY `mtx_product_language`.`id` ASC LIMIT 1
---
          <td>
            <%= daily_menu_detail.mtx_product.mtx_product_languages.first.name %>