app/views/weekly_menu/_form.html.erb

SELECT  `mtx_weekly_menu`.* FROM `mtx_weekly_menu` WHERE (day_key = 'mon') LIMIT 1
SELECT `mtx_weekly_menu_detail`.* FROM `mtx_weekly_menu_detail` WHERE `mtx_weekly_menu_detail`.`weekly_menu_id` = 1
---
               if !@productOfWeekDay.nil?
                 @productOfWeekDay.mtx_weekly_menu_details.each do |pOfDay|

SELECT  `mtx_product_language`.* FROM `mtx_product_language` WHERE `mtx_product_language`.`product_id` = 1  ORDER BY `mtx_product_language`.`id` ASC LIMIT 1
SELECT `mtx_product`.* FROM `mtx_product`
---
              <td><%= check_box_tag("ids[]", p.id, @checked)%></td>
              <td><%= p.mtx_product_languages.first.name %></td>